Repository: tek-part/parkingtec
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: WAFY PARK
ar: الوافي باركن

# appSubtitle
source: Smart Parking Solutions
ar: حلول الإيقاف الذكية

# loginTitle
source: Login
ar: تسجيل الدخول

source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة المرور

# loginButton
source: Login
ar: تسجيل الدخول

# pleaseEnterPhone
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

source: Find Parking
ar: البحث عن موقف

source: History
ar: التاريخ

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Success
ar: نجح

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Settings
ar: الإعدادات

source: Profile
ar: الملف الشخصي

source: Logout
ar: تسجيل الخروج

source: Start Daily
ar: بدء اليومية

source: Start Daily Session
ar: بدء جلسة اليومية

source: Start Session
ar: بدء الجلسة

source: Start balance
ar: رصيد البداية

source: Notes (optional)
ar: ملاحظات (اختياري)

# invalidStartBalance
source: Please enter a valid start balance
ar: يرجى إدخال رصيد بداية صالح

# dailyStartedSuccess
source: Daily started successfully
ar: تم بدء اليومية بنجاح

# dailyAlreadyOpen
source: A daily is already open
ar: هناك يومية مفتوحة بالفعل

source: Create Invoice
ar: إنشاء فاتورة

source: Terminate Daily
ar: إنهاء اليومية

source: End balance
ar: رصيد النهاية

# invalidEndBalance
source: Please enter a valid end balance
ar: يرجى إدخال رصيد نهاية صالح

# dailyTerminatedSuccess
source: Daily terminated successfully
ar: تم إنهاء اليومية بنجاح

source: Are you sure you want to terminate the daily?
ar: هل أنت متأكد من أنك تريد إنهاء اليومية؟

# terminate
source: Terminate Daily
ar: إنهاء اليومية

source: Customer Name
ar: اسم العميل

source: Car Number
ar: رقم السيارة

# carNumberRequired
source: Car number is required
ar: رقم السيارة مطلوب

source: Car Model
ar: موديل السيارة

source: Car Model (Optional)
ar: موديل السيارة (اختياري)

source: Customer Name (Optional)
ar: اسم العميل (اختياري)

source: Car Color
ar: لون السيارة

source: Amount
ar: المبلغ

# currency
source: EGP
ar: جنيه

source: Date
ar: التاريخ

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

source: Create
ar: إنشاء

source: Done
ar: تم

source: Print Invoice
ar: طباعة الفاتورة

source: Print
ar: طباعة

source: Remove
ar: إزالة

# invoiceCreatedSuccess
source: Invoice created successfully
ar: تم إنشاء الفاتورة بنجاح

# amountWillBeCalculated
source: Amount will be calculated based on hourly rate when invoice is completed
ar: سيتم حساب المبلغ بناءً على سعر الساعة عند إكمال الفاتورة

# invoicePrintedSuccess
source: Invoice printed successfully
ar: تم طباعة الفاتورة بنجاح

source: Print failed
ar: فشلت الطباعة

source: Print error
ar: خطأ في الطباعة

source: Invoice History
ar: تاريخ الفواتير

source: No invoices found
ar: لم يتم العثور على فواتير

source: Clear History
ar: مسح التاريخ

# clearHistoryConfirmation
source: Are you sure you want to clear all invoices?
ar: هل أنت متأكد من أنك تريد مسح جميع الفواتير؟

source: Clear
ar: مسح

source: Invoice removed
ar: تم إزالة الفاتورة

source: History cleared
ar: تم مسح التاريخ

source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

# pleaseEnterEndBalance
source: Please enter the end balance
ar: يرجى إدخال الرصيد النهائي

# pleaseEnterValidAmount
source: Please enter a valid amount
ar: يرجى إدخال مبلغ صالح

source: Notes
ar: ملاحظات

# enterNotes
source: Enter notes (optional)
ar: أدخل ملاحظات (اختياري)

source: Logout Confirmation
ar: تأكيد تسجيل الخروج

# endBalanceRequired
source: End balance is required
ar: رصيد النهاية مطلوب

# invalidAmountFormat
source: Please enter a valid amount
ar: يرجى إدخال مبلغ صالح

# logoutError
source: An error occurred during logout
ar: حدث خطأ أثناء تسجيل الخروج

# sessionEndError
source: Error ending active session
ar: خطأ في إنهاء الجلسة النشطة

source: Processing logout...
ar: جاري معالجة تسجيل الخروج...

# endingSession
source: Ending active session...
ar: جاري إنهاء الجلسة النشطة...

# logoutSuccess
source: Logged out successfully
ar: تم تسجيل الخروج بنجاح

source: Confirm Logout
ar: تأكيد تسجيل الخروج

# logoutWarning
source: This action will end your current session and log you out of the application.
ar: هذا الإجراء سينهي جلستك الحالية وسيسجل خروجك من التطبيق.

# endBalanceDescription
source: Enter the final balance for your daily operations
ar: أدخل الرصيد النهائي لعملياتك اليومية

# notesDescription
source: Add any additional notes or comments (optional)
ar: أضف أي ملاحظات أو تعليقات إضافية (اختياري)

# requiredField
source: This field is required
ar: هذا الحقل مطلوب

# optionalField
source: This field is optional
ar: هذا الحقل اختياري

source: Print Options
ar: خيارات الطباعة

source: Print PDF on Sunmi
ar: طباعة PDF على Sunmi

# printPdfOnSunmiSubtitle
source: Print PDF directly on thermal printer
ar: طباعة PDF مباشرة على الطابعة الحرارية

source: Print Native on Sunmi
ar: طباعة Native على Sunmi

# printNativeOnSunmiSubtitle
source: Print receipt directly without PDF
ar: طباعة إيصال مباشر بدون PDF

source: Preview PDF
ar: معاينة PDF

# previewPdfSubtitle
source: Open in PDF viewer
ar: فتح في عارض PDF

source: Share
ar: مشاركة

# shareSubtitle
source: Share via other apps
ar: مشاركة عبر التطبيقات الأخرى

source: Open in Browser
ar: فتح في المتصفح

# openInBrowserSubtitle
source: View in external browser
ar: عرض في المتصفح الخارجي

source: More Options
ar: خيارات إضافية

# moreOptionsSubtitle
source: Native, preview, share, and more
ar: Native، معاينة، مشاركة، والمزيد

source: Print Preview
ar: معاينة الطباعة

source: Print PDF
ar: طباعة PDF

source: Print Native
ar: طباعة Native

source: Printing...
ar: جاري الطباعة...

source: Print successful!
ar: تم الطباعة بنجاح!

source: Invoice data not available
ar: بيانات الإيصال غير متوفرة

source: Additional Options
ar: خيارات إضافية

# mustTerminateDailyBeforeLogout
source: You must terminate the daily before logging out
ar: يجب إنهاء الوردية قبل تسجيل الخروج

source: Enter end balance
ar: أدخل الرصيد النهائي

source: Enter any notes...
ar: أدخل أي ملاحظات...

source: Terminate Daily and Logout
ar: إنهاء الوردية والخروج

source: Error terminating daily
ar: خطأ في إنهاء الوردية

source: Welcome Back
ar: مرحبا بعودتك

source: Sign in to continue
ar: تسجيل الدخول للمتابعة

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف

source: Sign In
ar: تسجيل الدخول

# loginFailed
source: Login failed: {error}
ar: فشل تسجيل الدخول: {error}

source: User not authenticated
ar: المستخدم غير مصرح له

source: End Session
ar: إنهاء الجلسة

source: End your daily shift
ar: إنهاء ورديتك اليومية

# simpleLogout
source: Logout
ar: تسجيل الخروج

# areYouSureLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

# endSessionDialogTitle
source: End Daily Session
ar: إنهاء الجلسة اليومية

source: Confirm End Session
ar: تأكيد إنهاء الجلسة

# endSessionConfirmationMessage
source: The daily session will be ended with balance {amount}
ar: سيتم إنهاء الجلسة اليومية برصيد {amount}

# endSessionSuccess
source: Session ended successfully
ar: تم إنهاء الجلسة بنجاح

# startBalanceRequired
source: Start balance is required
ar: رصيد البداية مطلوب

source: App Config
ar: إعدادات التكوين

source: System Name
ar: اسم النظام

source: Pricing Type
ar: نوع التسعير

# fixedPricing
source: Fixed
ar: ثابت

# hourlyPricing
source: Hourly
ar: بالساعة

source: Default Fixed Price
ar: السعر الثابت الافتراضي

source: Default Hourly Rate
ar: سعر الساعة الافتراضي

source: Currency Symbol
ar: رمز العملة

source: Barcode Enabled
ar: تفعيل الباركود

source: Show Prices
ar: إظهار الأسعار

# configLoading
source: Loading configuration...
ar: جاري تحميل الإعدادات...

# configError
source: Error loading configuration
ar: حدث خطأ في تحميل الإعدادات

# noConfigFound
source: No configuration found
ar: لم يتم العثور على الإعدادات

source: Enabled
ar: مفعل

source: Disabled
ar: معطل

source: Retry
ar: إعادة المحاولة

source: Invoices
ar: الفواتير

source: All Invoices
ar: جميع الفواتير

source: Active Invoices
ar: الفواتير النشطة

source: Pending Invoices
ar: الفواتير قيد الإحضار

source: Invoice Details
ar: تفاصيل الفاتورة

source: Scan QR Code
ar: مسح QR Code

# scanQrCodeInstructions
source: Position QR Code within the frame to scan
ar: ضع QR Code داخل الإطار لمسحه

source: Invalid QR Code
ar: QR Code غير صحيح

source: Search by car number
ar: البحث برقم السيارة

source: Enter car number
ar: أدخل رقم السيارة

source: No invoices
ar: لا توجد فواتير

source: No active invoices
ar: لا توجد فواتير نشطة

source: No pending invoices
ar: لا توجد فواتير قيد الإحضار

source: Invoice ID
ar: رقم الفاتورة

source: Invoice Status
ar: حالة الفاتورة

source: Active
ar: نشطة

source: Pending
ar: قيد الإحضار

source: Completed
ar: مكتملة

source: Start Time
ar: وقت البداية

source: End Time
ar: وقت النهاية

source: Duration
ar: المدة

source: hours
ar: ساعات

source: Paid
ar: مدفوعة

source: Unpaid
ar: غير مدفوعة

source: End Invoice
ar: إنهاء الفاتورة

source: Complete Invoice
ar: إكمال الفاتورة

source: Pay Invoice
ar: دفع الفاتورة

source: Pickup Invoice
ar: استلام السيارة

# invoiceCompleted
source: Invoice completed successfully
ar: تم إكمال الفاتورة بنجاح

# invoicePaid
source: Invoice paid successfully
ar: تم دفع الفاتورة بنجاح

# invoicePickedUp
source: Invoice picked up successfully
ar: تم استلام السيارة بنجاح

# invoiceCompletedError
source: Error completing invoice
ar: خطأ في إكمال الفاتورة

# invoicePaidError
source: Error paying invoice
ar: خطأ في دفع الفاتورة

# invoicePickedUpError
source: Error picking up invoice
ar: خطأ في استلام السيارة

# amountRequired
source: Amount is required
ar: المبلغ مطلوب

source: Invalid amount
ar: مبلغ غير صحيح

# amountMismatch
source: Entered amount does not match required amount
ar: المبلغ المدخل لا يطابق المبلغ المطلوب

source: Refresh
ar: تحديث

source: Pull to refresh
ar: اسحب للتحديث

source: Loading invoices...
ar: جاري تحميل الفواتير...

source: Load Invoices
ar: تحميل الفواتير

# invoiceError
source: Error loading invoices
ar: خطأ في تحميل الفواتير

source: Hourly Rate
ar: سعر الساعة

source: Final Amount
ar: المبلغ النهائي

source: Current Amount
ar: المبلغ الحالي

source: Time Elapsed
ar: الوقت المنقضي

source: Request Car
ar: طلب السيارة

source: Car requested
ar: تم طلب السيارة

source: View Details
ar: عرض التفاصيل

# qrCodeRequired
source: QR Code is required to complete this invoice
ar: QR Code مطلوب لإنهاء هذه الفاتورة

# scanQrToComplete
source: You must scan QR Code to complete the invoice
ar: يجب مسح QR Code لإنهاء الفاتورة

source: Invoice not found
ar: الفاتورة غير موجودة

source: Search
ar: بحث

source: Clear search
ar: مسح البحث

source: Printer Settings
ar: إعدادات الطابعة

source: Printer Type
ar: نوع الطابعة

# printerTypeNone
source: None
ar: لا يوجد

source: Paper Width
ar: عرض الورق

source: Auto Print Options
ar: خيارات الطباعة التلقائية

source: Auto Print on Create
ar: الطباعة التلقائية عند الإنشاء

# autoPrintOnCreateDesc
source: Automatically print entry ticket when invoice is created
ar: طباعة تذكرة الدخول تلقائياً عند إنشاء الفاتورة

source: Auto Print on Complete
ar: الطباعة التلقائية عند الإكمال

# autoPrintOnCompleteDesc
source: Automatically print exit receipt when invoice is completed
ar: طباعة إيصال الخروج تلقائياً عند إكمال الفاتورة

source: Test Print
ar: طباعة تجريبية

# testPrintSuccess
source: Test print successful
ar: تمت الطباعة التجريبية بنجاح

source: Reprint Ticket
ar: إعادة طباعة التذكرة

source: Reprint Receipt
ar: إعادة طباعة الإيصال

source: Connected
ar: متصل

source: Disconnected
ar: غير متصل

source: Connect
ar: اتصال

source: Disconnect
ar: قطع الاتصال

source: Printers
ar: الطابعات

source: Stop
ar: إيقاف

source: Unknown
ar: غير معروف

source: Searching for printers...
ar: جاري البحث عن الطابعات...

source: Connected printer shown at top
ar: الطابعة المتصلة معروضة في الأعلى

source: No printers. Press search
ar: لا توجد طابعات. اضغط على البحث

source: Connected Printer
ar: الطابعة المتصلة

source: Please enable Bluetooth
ar: يرجى تفعيل البلوتوث

source: Invoice Language
ar: لغة الفاتورة

source: Slice Height
ar: ارتفاع الشريحة

source: Print Settings
ar: إعدادات الطباعة

# previewLabel
source: Preview
ar: معاينة

source: App Settings
ar: إعدادات التطبيق

source: Theme
ar: المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: النظام

source: Language
ar: اللغة

source: Preparing invoice...
ar: جاري إعداد الفاتورة...

source: Select Printer Type
ar: اختر نوع الطابعة

source: Connection Status
ar: حالة الاتصال

source: Not Connected
ar: غير متصل

source: Scanning...
ar: جاري البحث...

source: Scan Devices
ar: البحث عن الأجهزة

source: Scan error
ar: خطأ في البحث

source: Available Devices
ar: الأجهزة المتاحة

source: Connected Device
ar: الجهاز المتصل

source: Ready
ar: جاهز

source: Not Initialized
ar: غير مهيأ

source: Initialize Printer
ar: تهيئة الطابعة

source: Printer initialized
ar: تم تهيئة الطابعة

source: Print sent
ar: تم إرسال الطباعة

# connectedToDevice
source: Connected to {deviceName}
ar: متصل بـ {deviceName}

source: Connection failed
ar: فشل الاتصال

# noPrinterConnected
source: No printer connected. Please connect a printer first.
ar: لا توجد طابعة متصلة. يرجى الاتصال بطابعة أولاً.

source: Sunmi print error
ar: خطأ في طباعة Sunmi

source: Bluetooth print error
ar: خطأ في طباعة Bluetooth

source: Bluetooth printer not connected
ar: طابعة Bluetooth غير متصلة

# pleaseConnectToPrinterFirst
source: Please connect to a printer first
ar: يرجى الاتصال بطابعة أولاً

# bluetoothTestPrintNotImplemented
source: Bluetooth test print - implement ESC/POS commands
ar: طباعة تجريبية Bluetooth - تنفيذ أوامر ESC/POS

source: Printer Not Connected
ar: الطابعة غير متصلة

# printerNotConnectedMessage
source: You are not connected to a printer. Please connect a printer to print invoices.
ar: أنت غير متصل بطابعة. يرجى الاتصال بطابعة لطباعة الفواتير.

source: Go to Settings
ar: الذهاب إلى الإعدادات

source: Continue without printing
ar: المتابعة بدون طباعة
